app/views/video/index.html.erb

SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "video_usages" WHERE "video_usages"."video_id" = ?  [["video_id", 1]]
---
    <br>
    Viewers: <%= video.VideoUsage.count %>