app/views/video/show.html.erb


<% @video.VideoUsage.each do |usage| %>
---
SELECT "video_usages".* FROM "video_usages" WHERE "video_usages"."video_id" = ?  [["video_id", 2]]