app/controllers/video_controller.rb

  def create
    random_time = Random.rand(100..600)
    @video = Video.new(video_params)
    @video.length = Time.at(random_time).utc

    if !(/[a-zA-Z]/.match?(video_params["video_id"])) && @video.save

      # This will pick a random number deciding how many people will be created or how many views the video will get.
      x = Random.rand(1..20)
      while x >= 0
        @video.videoUsage.create()
        @video.videoUsage.last.user = (User.create(:name => Faker::Name.first_name, :age => Random.rand(18..60)))
---
SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "videos" ("video_id", "length", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["video_id", 1234], ["length", "2000-01-01 00:07:19"], ["created_at", "2018-04-29 02:27:41.692798"], ["updated_at", "2018-04-29 02:27:41.692798"]]
INSERT INTO "video_usages" ("video_id", "user_id", "watched", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["video_id", 2], ["user_id", 10], ["watched", "2000-01-01 00:06:17"], ["created_at", "2018-04-29 02:27:41.732190"], ["updated_at", "2018-04-29 02:27:41.732190"]]
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hollis"], ["age", 36], ["created_at", "2018-04-29 02:27:41.728908"], ["updated_at", "2018-04-29 02:27:41.728908"]]

  def index
    @videos = Video.all
---
SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def show
    @video = Video.find(params[:id])
    length = @video.length.hour * 3600
    length += @video.length.min * 60
    length += @video.length.sec

    @data = []
    @video.videoUsage.each do |video|
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "video_usages".* FROM "video_usages" WHERE "video_usages"."video_id" = ?  [["video_id", 2]]